<?php
    $a = 0;
    $b = 0;
    for( $i=0; $i<=5; $i++ )
    {
        $a += 10;
        $b += 5;
        echo "<br />Шаг $i: значение a = " . $a . ", значение b = " . $b; // вывод промежуточных значений
    }
    echo "<br />Конец цикла, и значение a = " . $a . ", а значение b = " . $b . "<br />";
?>
<?php
    $i = 0;
    $num = 50;
    while( $i < 10)
    {
        $num--;
        $i++;
        echo ("<br />Шаг $i: значение i = $i и значение num = $num" ); // вывод промежуточных значений
    }
    echo ("<br />Цикл завершен на i = $i шаге и num = $num <br />");
?>
<?php
    $adaos = 7;
    $pret = 120;
    do{
        $pret=$pret + $adaos;
        $adaos++;
        echo ("<br />Промежуточное значение цены товара: $pret" ); // вывод промежуточных значений
    }
    while( $adaos < 10 );
    echo ("<br />Новая цена товара будет: $pret <br />");
?>

